app/views/users/show.html.erb

<p>
 Has made <%= pluralize(@user.ratings.count, 'rating') %>
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."user_id" = ?  [["user_id", 2]]
SELECT COUNT(*) FROM "ratings" WHERE "ratings"."user_id" = ?  [["user_id", 1]]


<% if @user.ratings.any? %>
---
SELECT  1 AS one FROM "ratings" WHERE "ratings"."user_id" = ? LIMIT 1  [["user_id", 1]]