app/views/beers/_form.html.erb

SELECT "styles".* FROM "styles"
---
  <div class="field">
     <%= f.select :style, options_for_select(@styles) %>