app/controllers/beers_controller.rb

   def index

      @beers = Beer.includes(:brewery, :style).all
---
SELECT "beers".* FROM "beers"

  def new
    @beer = Beer.new
    @breweries = Brewery.all
    @styles = Style.all
---
SELECT "breweries".* FROM "breweries"
SELECT "styles".* FROM "styles"

  def create
    ["beerlist-name", "beerlist-brewery", "beerlist-style"].each{ |f| expire_fragment(f) }
    @beer = Beer.new(beer_params)

    respond_to do |format|
      if @beer.save
        format.html { redirect_to beers_path, notice: 'Beer was successfully created.' }
        format.json { render :show, status: :created, location: @beer }
      else
        @breweries = Brewery.all
---
INSERT INTO "beers" ("name", "style", "brewery_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "vaahtoava"], ["style", "IPA"], ["brewery_id", 1], ["created_at", "2016-02-07 17:22:46.146262"], ["updated_at", "2016-02-07 17:22:46.146262"]]
SELECT "breweries".* FROM "breweries"