app/controllers/beer_clubs_controller.rb

  def show
     @membership = Membership.new

    @membership.beer_club = @beer_club

    if not is_not_member(current_user, @beer_club)
      @membership = current_user.memberships.find_by beer_club_id: @beer_club.id
---
SELECT  "memberships".* FROM "memberships" WHERE "memberships"."user_id" = ? AND "memberships"."beer_club_id" = ? LIMIT 1  [["user_id", 8], ["beer_club_id", 1]]

  def create
    @beer_club = BeerClub.new(beer_club_params)

    respond_to do |format|
      if @beer_club.save
---
INSERT INTO "beer_clubs" ("name", "founded", "city", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Punanenät"], ["founded", 1990], ["city", "Helsinki"], ["created_at", "2016-02-13 22:36:28.975890"], ["updated_at", "2016-02-13 22:36:28.975890"]]