app/controllers/beers_controller.rb

  def create
    ["beerlist-name", "beerlist-brewery", "beerlist-style"].each{ |f| expire_fragment(f) }
    @beer = Beer.new(beer_params)

    respond_to do |format|
      if @beer.save
        format.html { redirect_to beers_path, notice: 'Beer was successfully created.' }
        format.json { render :show, status: :created, location: @beer }
      else
        @breweries = Brewery.all
        @styles = Style.all
---
INSERT INTO "beers" ("name", "style_id", "brewery_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "CrapIPA"], ["style_id", 1], ["brewery_id", 1], ["created_at", "2016-02-27 01:30:24.424192"], ["updated_at", "2016-02-27 01:30:24.424192"]]
SELECT "styles".* FROM "styles"