app/controllers/breweries_controller.rb

INSERT INTO "breweries" ("name", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Kaarlsberg"], ["year", 1854], ["created_at", "2016-02-28 16:43:58.125401"], ["updated_at", "2016-02-28 16:43:58.125401"]]
---
  def create
    @brewery = Brewery.new(brewery_params)

    respond_to do |format|
      if @brewery.save

UPDATE "breweries" SET "active" = ?, "updated_at" = ? WHERE "breweries"."id" = ?  [["active", "f"], ["updated_at", "2016-02-28 16:54:19.988475"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @brewery.update(brewery_params)