app/controllers/memberships_controller.rb

  def new
    @membership = Membership.new
    @clubs = BeerClub.all.reject{ |club| current_user.in? club.members }
---
SELECT "beer_clubs".* FROM "beer_clubs"

  def create
    @membership = Membership.new(membership_params)
    club = BeerClub.find membership_params[:beer_club_id]
    if not current_user.in? club.members and @membership.save
---
SELECT  "beer_clubs".* FROM "beer_clubs" WHERE "beer_clubs"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "memberships" ("beer_club_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["beer_club_id", 1], ["user_id", 1], ["created_at", "2016-02-13 22:45:58.680544"], ["updated_at", "2016-02-13 22:45:58.680544"]]
UPDATE "memberships" SET "user_id" = ?, "updated_at" = ? WHERE "memberships"."id" = ?  [["user_id", 4], ["updated_at", "2016-02-22 18:03:21.178043"], ["id", 3]]

  def destroy


    @beer_club = @membership.beer_club

    @membership.destroy
---
DELETE FROM "memberships" WHERE "memberships"."id" = ?  [["id", 7]]