app/controllers/ratings_controller.rb

SELECT "ratings".* FROM "ratings"  ORDER BY "ratings"."created_at" DESC
---
	def index
	 	@ratings = Rating.all

INSERT INTO "ratings" ("score", "beer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["score", 10], ["beer_id", 2], ["created_at", "2016-02-06 23:51:24.490061"], ["updated_at", "2016-02-06 23:51:24.490061"]]
SELECT "beers".* FROM "beers"
---
	def create

		@rating = Rating.new params.require(:rating).permit(:score, :beer_id)

		#talletetaan tehdyt reittaukset sessioon
		#session[:last_rating] = "#{rating.beer.name} #{rating.score} points"
		if @rating.save
			current_user.ratings << @rating
			redirect_to user_path current_user
		else
			@beers = Beer.all