app/controllers/styles_controller.rb

  def index
    @styles = Style.all
---
SELECT "styles".* FROM "styles"

    def set_style
      @style = Style.find(params[:id])
---
SELECT  "styles".* FROM "styles" WHERE "styles"."id" = ? LIMIT 1  [["id", 1]]