app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users = User.includes(:beers, :ratings).all

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", "pekka"], ["created_at", "2016-02-07 19:22:17.541396"], ["updated_at", "2016-02-07 19:22:17.541396"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]
---
  def destroy
    if current_user == @user
      @user.destroy